app/controllers/pharmacies_controller.rb

  def update
    current_pharmacy.update pharmacy_params
---
UPDATE "pharmacies" SET "pharmacy_name" = ?, "pharmacy_phone_number" = ?, "pharmacy_owner_first_name" = ?, "pharmacy_owner_last_name" = ?, "updated_at" = ? WHERE "pharmacies"."id" = ?